[
  {
    "path": "posts/QRM Prerequisites/",
    "title": "Quantitative and Risk Management Prerequisites",
    "description": "\"This is an article on the prerequisites for quantitative and risk management study.\"",
    "author": [
      {
        "name": "QuantBender",
        "url": "https://quantbender.github.io"
      }
    ],
    "date": "2024-10-01",
    "categories": [],
    "contents": "\n\nSource: Quantitative and Risk Management Prerequisites\nIntroduction\nThis article is a collection of the prerequisites for quantitative and risk management study. It is a guide for students who want to pursue a career in quantitative finance, risk management, or financial engineering. The prerequisites are divided into four categories: finance, mathematics, statistics, and programming.\nFinance\nFinance is the study of how individuals, businesses, and governments allocate resources over time. It is the science of money management. The following are the prerequisites for studying finance:\nBasic knowledge of financial markets and instruments\nUnderstanding of financial statements\nKnowledge of financial ratios\nUnderstanding of the time value of money\nKnowledge of risk and return\nUnderstanding of capital budgeting\nApart from these key notions, there some principles and notions which are required to the quantification and management of risk within any endeavour (and specifically in the financial world).\nNo Arbitration Opportunity (NOOA) principle: This principle states that there is no opportunity to make a risk-free profit by exploiting price differences between two or more markets. If there is an arbitrage opportunity, it will be quickly eliminated by market participants.\nYield Curve: Oxford defines it as “a curve on a graph in which the yield of fixed-interest securities is plotted against the length of time they have to run to maturity”. So basically, a yield curve gives an idea to an investor of how much he could expect to earn if he lends his money during a certain period of time.\nTypes of yield curves\nLong term vs short term expectations\nNormal\nhigher expected returns\nInverted\nlower expected returns (expectation of decline in inflation)\nSteep\nlong-term yields are rising at a faster rate than short-term yields.\nFlat\nall maturities have similar yields\nHumped\nmedium-term yields are greater than both short-term yields and long-term yields (slowing of economic groth).\nYield curves are mainly influenced by inflation, economic growth, and interest rates.\nHow Black-Scholes model is used in trading room?\nThis model, taking in account the time and other risk factors, is useful in estimating the theoretical value of derivatives based on different investment instruments (underlying assets in particular). It is a stochastic differential equation widely used to price European options contract because American ones could be exercises before the expiration date. The model requires five input variables: the strike price of the option, the current stock price, the time to expiration, the risk-free rate, and the volatility of the underlying stock. The model is based on the assumption that the price of the underlying asset follows a geometric Brownian motion with constant drift and volatility. The model is used in trading rooms to price options and other derivatives, to hedge risk, and to manage portfolios. The assumptions made by the model are sometimes violated in practice, leading to inaccurate pricing and hedging.\nThis is the Black-Scholes equation:\n\\[\n\\frac{\\partial V}{\\partial t} + \\frac{1}{2} \\sigma^2 S^2 \\frac{\\partial^2 V}{\\partial S^2} + rS \\frac{\\partial V}{\\partial S} - rV = 0\n\\],\nwhere \\(V\\) is the price of the option, \\(t\\) is time, \\(S\\) is the price of the underlying asset, \\(\\sigma\\) is the volatility of the underlying asset, and \\(r\\) is the risk-free rate.\nWe can write the option value as a function of the underlying asset price(S), the current time(t), the strike price(E), the date of expiry(T), the drift of the asset(\\(\\mu\\)), the volatility(\\(\\sigma\\)) of the asset, and the risk-free rate(r).\n\\[\nV = V(S, t; \\mu, \\sigma; E, T; r)\n\\]\nThe Black-Scholes model price is associated with the calculation of sensitivities: Delta, Vega, Gamma, Theta. How are these sensitivities used?\n\n\nSource: Paul Wilmott, Introduction to Quantitative Finance, Page 200\nDelta sensitivity is the rate of change of the option price with respect to the price of the underlying asset. It measures the change in the option price for a one-unit change in the price of the underlying asset. It is used to hedge the option price risk by taking an opposite position in the underlying asset.\nVega sensitivity is the rate of change of the option price with respect to the volatility of the underlying asset. It measures the change in the option price for a one-unit change in the volatility of the underlying asset. It is used to hedge the volatility risk by taking an opposite position in the underlying asset. It is also known as zeta and kappa.\nGamma sensitivity is the rate of change of the delta sensitivity with respect to the price of the underlying asset. It measures the change in the delta sensitivity for a one-unit change in the price of the underlying asset. It is used to hedge the delta sensitivity risk by taking an opposite position in the underlying asset.\nTheta sensitivity is the rate of change of the option price with respect to time. It measures the change in the option price for a one-unit change in time. It is used to hedge the time risk by taking an opposite position in the underlying asset. It is also known as the time decay of the option price.\nBlack & Scholes diffusion model: risk-free rate and volatility are assumed to be two constant parameters: \\(\\frac{dS(t)}{s(t)}=rdt+\\sigma dW(t)\\). Can we generalize the model by assuming that \\(t \\rightarrow r_{t}\\) and \\(t \\rightarrow \\sigma_{t}\\) are two deterministic functions? If so,vhow?\n\n\n\n",
    "preview": "https://cloudinary.hbs.edu/hbsit/image/upload/s--WzOmNSN1--/f_auto,c_fill,h_375,w_750,/v20200101/80AEA8DCA9AD880564BBF2D6A2581F3F.jpg",
    "last_modified": "2024-10-01T23:11:48+01:00",
    "input_file": {}
  }
]
